Show / Hide Table of Contents
Class BoltAssembly
Bolt assembly
Inheritance
System.Object
OpenObject
OpenElementId
BoltAssembly
Inherited Members
 OpenElementId.Id
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Material
Assembly: IdeaRS.OpenModel.dll
Syntax
[OpenModelClass("CI.StructModel.Libraries.Material.BoltAssembly,CI.Material", "CI.StructModel.Libraries.Material.BoltAssembly,CI.Material", typeof(BoltAssembly))]
public class BoltAssembly : OpenElementId
Properties
Improve this Doc   View Source
BoltGrade
Bolt grade
Declaration
public ReferenceElement BoltGrade { get; set; }
Property Value
 Type |  Description
 ReferenceElement
Improve this Doc   View Source
Borehole
Size of borehole
Declaration
public double Borehole { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
DiagonalHeadDiameter
Second diameter of the head
Declaration
public double DiagonalHeadDiameter { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Diameter
Bolt diameter
Declaration
public double Diameter { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
GrossArea
Gross cross-section area
Declaration
public double GrossArea { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
HeadDiameter
Diameter of the head
Declaration
public double HeadDiameter { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
HeadHeight
Thickness of head
Declaration
public double HeadHeight { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Name
Name of bolt assembly
Declaration
public string Name { get; set; }
Property Value
 Type |  Description
 System.String
Improve this Doc   View Source
NutThickness
Thickness of Nut
Declaration
public double NutThickness { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
TensileStressArea
Tensile stress area
Declaration
public double TensileStressArea { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
WasherAtHead
Washer at head side of bolt assembly
Declaration
public bool WasherAtHead { get; set; }
Property Value
 Type |  Description
 System.Boolean
Improve this Doc   View Source
WasherAtNut
Is washer at Nut side of bolt assembly
Declaration
public bool WasherAtNut { get; set; }
Property Value
 Type |  Description
 System.Boolean
Improve this Doc   View Source
WasherThickness
Thickness of washer
Declaration
public double WasherThickness { get; set; }
Property Value
 Type |  Description
 System.Double
 Improve this Doc
 View Source